app/views/ponente/show.html.erb

SELECT  "curriculum_vitaes".* FROM "curriculum_vitaes" WHERE "curriculum_vitaes"."id" = $1 LIMIT 1  [["id", 10]]
---
<% if @user.curriculum_vitae_id-%>
	<%= link_to "Ver Curriculum", CurriculumVitae.find(@user.curriculum_vitae_id) %>