app/views/curriculum_vitae/create.html.erb


<!-- <% @cv.formacion_academica.each do |formacionacademica| %>
---
SELECT "formacion_academicas".* FROM "formacion_academicas" WHERE "formacion_academicas"."curriculum_vitae_id" = $1  [["curriculum_vitae_id", 9]]