app/views/curriculum_vitae/edit.html.erb

            <div class="form-group">
              <% @cv.telefono_curriculum.each do |telefonocurriculum| %>
---
SELECT "telefono_curriculums".* FROM "telefono_curriculums" WHERE "telefono_curriculums"."curriculum_vitae_id" = $1  [["curriculum_vitae_id", 10]]

            <div class="form-group">
             <% @cv.correo_curriculum.each do |correocurriculum| %>
---
SELECT "correo_curriculums".* FROM "correo_curriculums" WHERE "correo_curriculums"."curriculum_vitae_id" = $1  [["curriculum_vitae_id", 10]]

              <%= f.label :areas_especializacion_id %>
              <%= f.collection_select(:areas_especializacion_id, AreasEspecializacion.all, :id, :area, {:multiple => true}) %>
---
SELECT "areas_especializacions".* FROM "areas_especializacions"


        <% @cv.formacion_academica.each do |formacionacademica| %>
---
SELECT "formacion_academicas".* FROM "formacion_academicas" WHERE "formacion_academicas"."curriculum_vitae_id" = $1  [["curriculum_vitae_id", 10]]


                  <input type="text" value=<%=CursoDeActualizacion.where(formacion_academica_id: formacionacademica.id ).first.nombre_curso %> name="curriculum_vitae[curso_de_actualizacion[][nombre_curso]" id="curriculum_vitae_curso_de_actualizacion__nombre_curso" class="form-control">
---
SELECT  "curso_de_actualizacions".* FROM "curso_de_actualizacions" WHERE "curso_de_actualizacions"."formacion_academica_id" = $1  ORDER BY "curso_de_actualizacions"."id" ASC LIMIT 1  [["formacion_academica_id", 10]]