app/views/curriculum_vitae/new.html.erb

              <%= f.label :areas_especializacion_id %>
              <%= f.collection_select(:areas_especializacion_id, AreasEspecializacion.all, :id, :area, {:multiple => true}) %>
---
SELECT "areas_especializacions".* FROM "areas_especializacions"