app/views/curriculum_vitae/show.html.erb

              <div class="col-xs-8">
                <p class="col-xs-8"><%=TelefonoCurriculum.where(curriculum_vitae_id: @cv.id).first.num_telefono %></p>
---
SELECT  "telefono_curriculums".* FROM "telefono_curriculums" WHERE "telefono_curriculums"."curriculum_vitae_id" = $1  ORDER BY "telefono_curriculums"."id" ASC LIMIT 1  [["curriculum_vitae_id", 10]]

              <div class="col-xs-10">
                <p class="col-xs-2 control-label"><%=CorreoCurriculum.where(curriculum_vitae_id: @cv.id).first.correo %></p>
---
SELECT  "correo_curriculums".* FROM "correo_curriculums" WHERE "correo_curriculums"."curriculum_vitae_id" = $1  ORDER BY "correo_curriculums"."id" ASC LIMIT 1  [["curriculum_vitae_id", 10]]

            <div class="form-group">
              <%=AreasEspecializacion.find(@cv.areas_especializacion_id).area %>
---
SELECT  "areas_especializacions".* FROM "areas_especializacions" WHERE "areas_especializacions"."id" = $1 LIMIT 1  [["id", 2]]

                  <div class="col-xs-9">
                    <%=FormacionAcademica.where(curriculum_vitae_id: @cv.id).first.area_especialidad %>
---
SELECT  "formacion_academicas".* FROM "formacion_academicas" WHERE "formacion_academicas"."curriculum_vitae_id" = $1  ORDER BY "formacion_academicas"."id" ASC LIMIT 1  [["curriculum_vitae_id", 10]]

              <label for="experiencia_docente">Experiencia docente:</label>
              <%=CursoDeActualizacion.where(formacion_academica_id: @formacion_academica.id).first.año %>
---
SELECT  "curso_de_actualizacions".* FROM "curso_de_actualizacions" WHERE "curso_de_actualizacions"."formacion_academica_id" = 10  ORDER BY "curso_de_actualizacions"."id" ASC LIMIT 1

          Cargos académico-administrativos:
          <%=CargoAcademico.where(id_experiencia_academica: @experiencia_academica.id).first.nombre_cargo_academico %><br>
---
SELECT  "cargo_academicos".* FROM "cargo_academicos" WHERE "cargo_academicos"."id_experiencia_academica" = 8  ORDER BY "cargo_academicos"."id" ASC LIMIT 1

          <label for="publicaciones">Publicaciones</label>
          <%=Publicacione.where(id_experiencia_academica: @experiencia_academica.id).first.nombre_publicaciones %><br>
---
SELECT  "publicaciones".* FROM "publicaciones" WHERE "publicaciones"."id_experiencia_academica" = $1  ORDER BY "publicaciones"."id" ASC LIMIT 1  [["id_experiencia_academica", 8]]

          Ponencias
          <%=Ponencia.where(id_experiencia_academica: @experiencia_academica.id).first.nombre_ponencias %><br>
---
SELECT  "ponencia".* FROM "ponencia" WHERE "ponencia"."id_experiencia_academica" = $1  ORDER BY "ponencia"."id" ASC LIMIT 1  [["id_experiencia_academica", 8]]

          Conferencias
          <%=Conferencium.where(id_experiencia_academica: @experiencia_academica.id).first.nombre_conferencia %><br>
---
SELECT  "conferencia".* FROM "conferencia" WHERE "conferencia"."id_experiencia_academica" = $1  ORDER BY "conferencia"."id" ASC LIMIT 1  [["id_experiencia_academica", 8]]

          Congresos
          <%=Congreso.where(id_experiencia_academica: @experiencia_academica.id).first.nombre_congreso %><br>
---
SELECT  "congresos".* FROM "congresos" WHERE "congresos"."id_experiencia_academica" = $1  ORDER BY "congresos"."id" ASC LIMIT 1  [["id_experiencia_academica", 8]]

          <label for="formacion_rh">Asesorías Impartidas</label>
          <%=AsesoriasImpartida.where(id_experiencia_academica: @experiencia_academica.id).first.nombre_asesorias_impartidas %><br>
---
SELECT  "asesorias_impartidas".* FROM "asesorias_impartidas" WHERE "asesorias_impartidas"."id_experiencia_academica" = $1  ORDER BY "asesorias_impartidas"."id" ASC LIMIT 1  [["id_experiencia_academica", 8]]

          <label for="formacion_rh">Tutorías Impartidas</label>
          <%=TutoriasImpartida.where(id_experiencia_academica: @experiencia_academica.id).first.nombre_tutorias_impartidas %><br>
---
SELECT  "tutorias_impartidas".* FROM "tutorias_impartidas" WHERE "tutorias_impartidas"."id_experiencia_academica" = $1  ORDER BY "tutorias_impartidas"."id" ASC LIMIT 1  [["id_experiencia_academica", 8]]

          <label for="cursos_impartidos">Cursos impartidos (últimos 3 años)</label>
          <%=CursosImpartido.where(id_experiencia_academica: @experiencia_academica.id).first.nombre_cursos_impartidos %>
---
SELECT  "cursos_impartidos".* FROM "cursos_impartidos" WHERE "cursos_impartidos"."id_experiencia_academica" = $1  ORDER BY "cursos_impartidos"."id" ASC LIMIT 1  [["id_experiencia_academica", 8]]

          Empresa de adscripción
           <%=EntidadAcademica.where(id_experiencia_profesional: @experiencia_profesional.id).first.nombre_entidad_academica %>
---
SELECT  "entidad_academicas".* FROM "entidad_academicas" WHERE "entidad_academicas"."id_experiencia_profesional" = 8  ORDER BY "entidad_academicas"."id" ASC LIMIT 1

                  <div class="col-xs-7">
                    <%=Reconocimiento.where(curriculum_vitae_id: @cv.id).first.nombre_reconocimiento %>
---
SELECT  "reconocimientos".* FROM "reconocimientos" WHERE "reconocimientos"."curriculum_vitae_id" = $1  ORDER BY "reconocimientos"."id" ASC LIMIT 1  [["curriculum_vitae_id", 10]]