app/views/welcome/index.html.erb

                      <ul class="dropdown-menu">
                        <li><%= link_to "Ver Curriculum", CurriculumVitae.find(current_ponente.curriculum_vitae_id) %></li>
---
SELECT  "curriculum_vitaes".* FROM "curriculum_vitaes" WHERE "curriculum_vitaes"."id" = $1 LIMIT 1  [["id", 10]]