app/views/actividads/index.html.erb

SELECT  "curriculum_vitaes".* FROM "curriculum_vitaes" WHERE "curriculum_vitaes"."id" = $1 LIMIT 1  [["id", 10]]
---
                      <ul class="dropdown-menu">
                        <li><%= link_to "Ver Curriculum", CurriculumVitae.find(current_ponente.curriculum_vitae_id) %></li>