app/views/actividads/new.html.erb

                    <ul class="dropdown-menu">
                      <li><%= link_to "Ver Curriculum", CurriculumVitae.find(current_ponente.curriculum_vitae_id) %></li>
---
SELECT  "curriculum_vitaes".* FROM "curriculum_vitaes" WHERE "curriculum_vitaes"."id" = $1 LIMIT 1  [["id", 10]]

							<br>
							<%= f.collection_select(:idtipo, Tipo.all, :id, :nombretipo) %>
---
SELECT "tipos".* FROM "tipos"

							&nbsp;&nbsp;
							<%= f.collection_select(:idmodalidad, Modalidad.all, :id, :nombremodalidad) %>
---
SELECT "modalidads".* FROM "modalidads"

							 <%= f.label :Sede %><br>
							 <%= f.collection_select(:idsede, Sede.all, :id, :nombresede) %>
---
SELECT "sedes".* FROM "sedes"


							<%= f.collection_select(:idareaacademica, AreaAcademica.all, :id, :nombrearea) %>
---
SELECT "area_academicas".* FROM "area_academicas"


							<%= f.collection_select(:idmateria, Materium.all, :id, :nombremateria) %>
---
SELECT "materia".* FROM "materia"

								<%= f.label :Dirigido_a %>
							<%= f.collection_select(:idpublicodirigido, PublicoDirigido.all, :id, :nombrepublico) %>
---
SELECT "publico_dirigidos".* FROM "publico_dirigidos"