app/controllers/actividads_controller.rb

  def myactividads
    @actividads = Actividad.where(idponente: current_ponente.id)
---
SELECT "actividads".* FROM "actividads" WHERE "actividads"."idponente" = $1  [["idponente", 1]]

  def show

  	@ponente = Ponente.find(current_ponente.id)
---
SELECT  "ponentes".* FROM "ponentes" WHERE "ponentes"."id" = $1  ORDER BY "ponentes"."id" ASC LIMIT 1  [["id", 1]]

  def showSolicitud
      @actividad = Actividad.find(params[:id])
---
SELECT  "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT 1  [["id", 1]]

  def index
    if current_usuario
      @actividads = Actividad.where("autorizado = 1 and id not in (select idactividad from registrars where idinteresado = ?)", current_usuario.id)
---
SELECT "actividads".* FROM "actividads" WHERE (autorizado = 1 and id not in (select idactividad from registrars where idinteresado = 1))

  def new
    unless current_ponente.curriculum_vitae_id
      flash[:notice] = "Necesitas crear tu curriculum vitae para poder continuar"
      redirect_to new_curriculum_vitae_path
    end

    @actividads = Actividad.new
    @ponente = Ponente.find(current_ponente.id)#obtenemos el ponente que esta creando la actividad
    @actividads.idponente = @ponente.id#asociamos la actividad con el id de ponente
    @areas_especializacion = AreasEspecializacion.all
    @modalidad = Modalidad.all
    @area_academica = AreaAcademica.all
    @materia = Materium.all
    @disciplina = Disciplina.all
    @publico_dirigido = PublicoDirigido.all
---
SELECT  "curriculum_vitaes".* FROM "curriculum_vitaes" WHERE "curriculum_vitaes"."id" = $1 LIMIT 1  [["id", 10]]
SELECT  "ponentes".* FROM "ponentes" WHERE "ponentes"."id" = $1  ORDER BY "ponentes"."id" ASC LIMIT 1  [["id", 1]]
SELECT "modalidads".* FROM "modalidads"
SELECT "area_academicas".* FROM "area_academicas"
SELECT "publico_dirigidos".* FROM "publico_dirigidos"

  def create

    @paramss = parametros_f
    puts @paramss

    @actividad = Actividad.new(parametros)  #creamos un objeto 'actividad' a partir de los parametros requeridos
    @actividad.idponente = current_ponente.id
    @actividad.autorizado = 0;
    puts @actividad.to_json

    @ponente = Ponente.find(current_ponente.id)#obtenemos el ponente que esta creando la actividad
    @actividad.idponente = @ponente.id#asociamos la actividad con el id de ponente


    if @actividad.save!  #verificamos si se puede guardar
      puts @actividad.to_json

      @co = parametros_f[:contenido] #sacamos toda la info de 'contenidos'
       puts @co.to_json

      @co.each do |f| #multiples

        @f = Contenido.new(f)  #creamos una tupla de la tabla 'contenido' a partir de los parametros requeridos
        @f.actividad_id = @actividad.id #le asignamos el id del curriculum al que pertenece

        if @f.valid? #verificamos que sea valido
          @f.save!  #guardamos
---
SELECT  "ponentes".* FROM "ponentes" WHERE "ponentes"."id" = $1  ORDER BY "ponentes"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "actividads" ("nombre", "descripcion", "duracionhoras", "numerosesiones", "objetivoespecifico", "objetivogeneral", "materialdidactico", "dias", "horario", "duracion", "fechainicio", "fechafinal", "cupomaximo", "cupominimo", "metas", "costogeneral", "costoalumnos", "materialesparaalumnos", "materialesdealumnos", "idtipo", "idmodalidad", "idareaacademica", "idmateria", "idpublicodirigido", "idsede", "evaluacion", "idponente", "autorizado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30) RETURNING "id"
INSERT INTO "contenidos" ("numerotema", "tema", "subtemas", "numerohoras", "fechainicio", "fechafinal", "bibliografia", "actividad_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"