app/controllers/curriculum_vitae_controller.rb

  def new
    if current_ponente.curriculum_vitae_id
      @ponente = Ponente.find(current_ponente.id)
      redirect_to @ponente
    end

    @cv = CurriculumVitae.new
    @cv.delegacion = ""

  	@areasespecializacion = AreasEspecializacion.all #cargamos todas las areas de epecialización
---
SELECT "areas_especializacions".* FROM "areas_especializacions"

  def create
    @paramss = parametros_f
    puts @paramss
    @poenten = Ponente.find(current_ponente.id)

  	@cv = CurriculumVitae.new(parametros)  #creamos un objeto curriculum vitae a partir de los parametros requeridos
    puts @cv.to_json

    #verificamos si se puede guardar
    if @cv.save
      puts @cv.to_json

      @poenten.update(curriculum_vitae_id: @cv.id)



      #multiples formaciones academicas
      @fa = parametros_f[:formacion_academica]
      puts @fa.to_json

      @fa.each do |f|

        @f = FormacionAcademica.new(f)  #creamos formaciones academicas a partir de los parametros requeridos
        @f.curriculum_vitae_id = @cv.id #le asignamos el id del curriculum al que pertenece


        if @f.valid? #verificamos que sea valido
          @f.save!  #guardamos
        else
          @cv.destroy   #si esta repetidos se destruye el curriculum y se regresa a la pagina anterior
---
INSERT INTO "curriculum_vitaes" ("rfc", "nombre", "appaterno", "apmaterno", "fecha_nacimiento", "numero", "calle", "colonia", "delegacion", "ciudad", "cp", "institucion", "areas_especializacion_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT "formacion_academicas".* FROM "formacion_academicas" WHERE "formacion_academicas"."curriculum_vitae_id" = $1  [["curriculum_vitae_id", 9]]
INSERT INTO "formacion_academicas" ("area_especialidad", "ultimo_grado", "año", "entidad_academica", "curriculum_vitae_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
DELETE FROM "curriculum_vitaes" WHERE "curriculum_vitaes"."id" = $1  [["id", 19]]

        @r = Reconocimiento.new(r) #creamos un objeto a partir de los parametros requeridos
        @r.curriculum_vitae_id = @cv.id #asignamos el id del curriculum al que pertenece

        if @r.nombre_reconocimiento.blank? == false #si es valido lo guardamos
          @r.save!
---
SELECT  1 AS one FROM "reconocimientos" WHERE "reconocimientos"."nombre_reconocimiento" = 'Hola' LIMIT 1
SELECT "reconocimientos".* FROM "reconocimientos" WHERE "reconocimientos"."curriculum_vitae_id" = $1  [["curriculum_vitae_id", 3]]
INSERT INTO "reconocimientos" ("nombre_reconocimiento", "curriculum_vitae_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre_reconocimiento", "Hola"], ["curriculum_vitae_id", 3], ["created_at", "2015-10-10 03:00:41.328984"], ["updated_at", "2015-10-10 03:00:41.328984"]]

  def show
    begin
      @cv = CurriculumVitae.find(params[:id])
    rescue
      @cv = Ponente.find(current_ponente.curriculum_vitae_id)
---
SELECT  "curriculum_vitaes".* FROM "curriculum_vitaes" WHERE "curriculum_vitaes"."id" = $1 LIMIT 1  [["id", 10]]
SELECT  "ponentes".* FROM "ponentes" WHERE "ponentes"."id" = $1  ORDER BY "ponentes"."id" ASC LIMIT 1  [["id", 1]]

  def edit
    begin
      @cv = CurriculumVitae.find(params[:id])
    rescue
      @cv = Ponente.find(current_ponente.curriculum_vitae_id)
    end

    unless @cv.id == current_ponente.curriculum_vitae_id
      redirect_to :back, :alert => "No puedes acceder."
    end
    @areasespecializacion = AreasEspecializacion.all
---
SELECT  "curriculum_vitaes".* FROM "curriculum_vitaes" WHERE "curriculum_vitaes"."id" = $1 LIMIT 1  [["id", 10]]
SELECT  "ponentes".* FROM "ponentes" WHERE "ponentes"."id" = $1  ORDER BY "ponentes"."id" ASC LIMIT 1  [["id", 1]]
SELECT "areas_especializacions".* FROM "areas_especializacions"