app/controllers/ponente_controller.rb

	def show
		begin
    		@user = Ponente.find(params[:id])
---
SELECT  "ponentes".* FROM "ponentes" WHERE "ponentes"."id" = $1  ORDER BY "ponentes"."id" ASC LIMIT 1  [["id", 1]]