app/controllers/registrar_controller.rb

SELECT "registrars".* FROM "registrars"
---
    def index
      @reg = Registrar.all

SELECT  "registrars".* FROM "registrars" WHERE "registrars"."id" = $1 LIMIT 1  [["id", 0]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 1]]
---
  	def show

  		#Registrar.create!(:idactividad => 12, :idinteresado => 1, :nombreactividad => 'curso de diana')
  	 @reg = Registrar.find(params[:id])
     @usuario = Usuario.find(current_usuario.id)