app/controllers/registrar_controller.rb

    def index
      @reg = Registrar.where(idinteresado: current_usuario.id)
---
SELECT "registrars".* FROM "registrars" WHERE "registrars"."idinteresado" = $1  [["idinteresado", 1]]

  	def show

  		#Registrar.create!(:idactividad => 12, :idinteresado => 1, :nombreactividad => 'curso de diana')
  	 @reg = Registrar.where(idinteresado: current_usuario.id)
---
SELECT "registrars".* FROM "registrars" WHERE "registrars"."idinteresado" = $1  [["idinteresado", 1]]

  def destroy
    @reg = Registrar.find(params[:id])
    @reg.destroy
---
SELECT  "registrars".* FROM "registrars" WHERE "registrars"."id" = $1 LIMIT 1  [["id", 62]]
DELETE FROM "registrars" WHERE "registrars"."id" = $1  [["id", 62]]

	def create
    @paramss = parametros
    puts @paramss

    @reg = Registrar.new(parametros)  #creamos un objeto 'registrar' a partir de los parametros requeridos
    @reg.idinteresado = current_usuario.id
    puts @reg.to_json

    if @reg.valid? #verificamos que sea valido
      @reg.save!  #guardamos
---
INSERT INTO "registrars" ("idactividad", "nombreactividad", "idinteresado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["idactividad", 7], ["nombreactividad", "Taller de escritura"], ["idinteresado", 1], ["created_at", "2015-12-02 05:00:37.673986"], ["updated_at", "2015-12-02 05:00:37.673986"]]

  def verifica
    @reg = Registrar.where(idactividad: params[:id]).count
    @act = Actividad.find(params[:id])
    @minimo = @act.cupominimo
    @users = Usuario.where("id in (select idinteresado from registrars where idactividad = ?)", params[:id])
    if @reg == @minimo
      puts "Si cumple el minimo"
      @users.each do |user|
        UsuarioMailer.disponible_email(user, @act).deliver_now
      end
      @pon = Ponente.find(@act.idponente)
---
SELECT COUNT(*) FROM "registrars" WHERE "registrars"."idactividad" = $1  [["idactividad", 3]]
SELECT  "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 2]]
SELECT  "ponentes".* FROM "ponentes" WHERE "ponentes"."id" = $1 LIMIT 1  [["id", 1]]