app/controllers/usuario_controller.rb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 1]]
---
	def show
		@usuario = Usuario.find(params[:id])